Most recent TF plan:
```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb.gitlab_alb will be updated in-place
  ~ resource "aws_lb" "gitlab_alb" {
        …
      ~ access_logs {
          ~ bucket  = "gitlab-alb.dev.singlecell.gi.ucsc.edu" -> (known after apply)
          ~ enabled = false -> true
          + prefix  = "logs/alb"
        }
        …
    }

  # aws_lb.gitlab_nlb will be updated in-place
  ~ resource "aws_lb" "gitlab_nlb" {
        …
      ~ access_logs {
          + bucket  = (known after apply)
          ~ enabled = false -> true
          + prefix  = "logs/nlb"
        }
        …
    }

  # aws_s3_bucket.gitlab will be created
  + resource "aws_s3_bucket" "gitlab" {
      + …
      + bucket                      = "edu-ucsc-gi-singlecell-azul-gitlab-dev-us-east-1"
      + …
    }

  # aws_s3_bucket_policy.gitlab will be created
  + resource "aws_s3_bucket_policy" "gitlab" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

------------------------------------------------------------------------

```